mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c3xj/projects/iar/startup_s6e2c3.s
                PUBWEAK ADC1_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
ADC1_IRQHandler
                B       ADC1_IRQHandler

                PUBWEAK USB0_F_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
USB0_F_IRQHandler
                B       USB0_F_IRQHandler

                PUBWEAK USB0_H_F_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
USB0_H_F_IRQHandler
                B       USB0_H_F_IRQHandler

                PUBWEAK DMAC0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
DMAC0_IRQHandler
                B       DMAC0_IRQHandler

                PUBWEAK DMAC1_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
DMAC1_IRQHandler
                B       DMAC1_IRQHandler

                PUBWEAK DMAC2_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
DMAC2_IRQHandler
                B       DMAC2_IRQHandler

                PUBWEAK DMAC3_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
DMAC3_IRQHandler
                B       DMAC3_IRQHandler

                PUBWEAK DMAC4_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
DMAC4_IRQHandler
                B       DMAC4_IRQHandler

                PUBWEAK DMAC5_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
DMAC5_IRQHandler
                B       DMAC5_IRQHandler

                PUBWEAK DMAC6_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
DMAC6_IRQHandler
                B       DMAC6_IRQHandler

                PUBWEAK DMAC7_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
DMAC7_IRQHandler
                B       DMAC7_IRQHandler

                PUBWEAK DSTC_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
DSTC_IRQHandler
                B       DSTC_IRQHandler

                PUBWEAK EXINT16_19_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
EXINT16_19_IRQHandler
                B       EXINT16_19_IRQHandler

                PUBWEAK EXINT20_23_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
EXINT20_23_IRQHandler
                B       EXINT20_23_IRQHandler

                PUBWEAK EXINT24_27_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
EXINT24_27_IRQHandler
                B       EXINT24_27_IRQHandler

                PUBWEAK EXINT28_31_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
EXINT28_31_IRQHandler
                B       EXINT28_31_IRQHandler

                PUBWEAK QPRC2_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
QPRC2_IRQHandler
                B       QPRC2_IRQHandler

                PUBWEAK QPRC3_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
QPRC3_IRQHandler
                B       QPRC3_IRQHandler

                PUBWEAK BT8_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
BT8_IRQHandler
                B       BT8_IRQHandler

                PUBWEAK BT9_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
BT9_IRQHandler
                B       BT9_IRQHandler

                PUBWEAK BT10_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
BT10_IRQHandler
                B       BT10_IRQHandler

                PUBWEAK BT11_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
BT11_IRQHandler
                B       BT11_IRQHandler

                PUBWEAK BT12_15_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
BT12_15_IRQHandler
                B       BT12_15_IRQHandler

                PUBWEAK MFS8_RX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
MFS8_RX_IRQHandler
                B       MFS8_RX_IRQHandler

                PUBWEAK MFS8_TX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
MFS8_TX_IRQHandler
                B       MFS8_TX_IRQHandler

                PUBWEAK MFS9_RX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
MFS9_RX_IRQHandler
                B       MFS9_RX_IRQHandler

                PUBWEAK MFS9_TX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
MFS9_TX_IRQHandler
                B       MFS9_TX_IRQHandler

                PUBWEAK MFS10_RX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
MFS10_RX_IRQHandler
                B       MFS10_RX_IRQHandler

                PUBWEAK MFS10_TX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
MFS10_TX_IRQHandler
                B       MFS10_TX_IRQHandler

                PUBWEAK MFS11_RX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
MFS11_RX_IRQHandler
                B       MFS11_RX_IRQHandler

                PUBWEAK MFS11_TX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
MFS11_TX_IRQHandler
                B       MFS11_TX_IRQHandler

                PUBWEAK ADC2_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
ADC2_IRQHandler
                B       ADC2_IRQHandler

                PUBWEAK DSTC_HW_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
DSTC_HW_IRQHandler
                B       DSTC_HW_IRQHandler

                PUBWEAK USB1_F_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
USB1_F_IRQHandler
                B       USB1_F_IRQHandler

                PUBWEAK USB1_H_F_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
USB1_H_F_IRQHandler
                B       USB1_H_F_IRQHandler

                PUBWEAK HSSPI_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
HSSPI_IRQHandler
                B       HSSPI_IRQHandler

                PUBWEAK PCRC_I2S0_1_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
PCRC_I2S0_1_IRQHandler
                B       PCRC_I2S0_1_IRQHandler

                PUBWEAK SD_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
SD_IRQHandler
                B       SD_IRQHandler

                PUBWEAK FLASHIF_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
FLASHIF_IRQHandler
                B       FLASHIF_IRQHandler

                PUBWEAK MFS12_RX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
MFS12_RX_IRQHandler
                B       MFS12_RX_IRQHandler

                PUBWEAK MFS12_TX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
MFS12_TX_IRQHandler
                B       MFS12_TX_IRQHandler

                PUBWEAK MFS13_RX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
MFS13_RX_IRQHandler
                B       MFS13_RX_IRQHandler

                PUBWEAK MFS13_TX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
MFS13_TX_IRQHandler
                B       MFS13_TX_IRQHandler

                PUBWEAK MFS14_RX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
MFS14_RX_IRQHandler
                B       MFS14_RX_IRQHandler

                PUBWEAK MFS14_TX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
MFS14_TX_IRQHandler
                B       MFS14_TX_IRQHandler

                PUBWEAK MFS15_RX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
MFS15_RX_IRQHandler
                B       MFS15_RX_IRQHandler

                PUBWEAK MFS15_TX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
MFS15_TX_IRQHandler
                B       MFS15_TX_IRQHandler




                PUBWEAK Dummy
                SECTION .text:CODE:REORDER:NOROOT(1)
Dummy
                B       Dummy

                END
